### Pandas Merging 101  

* https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.merge.html
* https://www.tutorialspoint.com/python_pandas/python_pandas_merging_joining.htm

In [21]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'], 'value': [1, 2, 3, 5]})
df1.head()

  lkey  value
0  foo      1
1  bar      2
2  baz      3
3  foo      5

In [3]:
df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'], 'value': [5, 6, 7, 8]})
df2.head()

  rkey  value
0  foo      5
1  bar      6
2  baz      7
3  foo      8

### No Parameters

In [4]:
no_params_merge = df1.merge(df2)
no_params_merge

  lkey  value rkey
0  foo      5  foo

### With Left and Right Parameters

In [5]:
left_and_right_params = df1.merge(df2, left_on='lkey', right_on='rkey')
left_and_right_params

  lkey  value_x rkey  value_y
0  foo        1  foo        5
1  foo        1  foo        8
2  foo        5  foo        5
3  foo        5  foo        8
4  bar        2  bar        6
5  baz        3  baz        7

### Another Example

In [12]:
df1 = pd.DataFrame({'a': ['foo', 'bar'], 'b': [1, 2]})
df2 = pd.DataFrame({'a': ['foo', 'baz'], 'c': [3, 4]})

In [7]:
initial_merge= df1.merge(df2)
initial_merge

     a  b  c
0  foo  1  3

In [8]:
b_merge = df1.merge(df2, how='inner', on='a')
b_merge

     a  b  c
0  foo  1  3

### Left Parameters

In [17]:
left_params = df1.merge(df2, how='left', on='a')
left_params

     a  b    c
0  foo  1  3.0
1  bar  2  NaN

### Right Parameters

In [19]:
right_params = df1.merge(df2, how='right', on='a')
right_params

     a    b  c
0  foo  1.0  3
1  baz  NaN  4

### Merge Two Dataframes on a Key

In [42]:
left = pd.DataFrame({
   'id':[1,2,3,4,5],
   'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
   'subject_id':['sub1','sub2','sub4','sub6','sub5']})
right = pd.DataFrame({
   'id':[1,2,3,4,5, 6],
   'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty', 'Bella'],
   'subject_id':['sub2','sub4','sub3','sub6','sub5', 'sub7']})

merge_df = pd.merge(left,right, on='id')
merge_df

   id  Name_x subject_id_x Name_y subject_id_y
0   1    Alex         sub1  Billy         sub2
1   2     Amy         sub2  Brian         sub4
2   3   Allen         sub4   Bran         sub3
3   4   Alice         sub6  Bryce         sub6
4   5  Ayoung         sub5  Betty         sub5

### Merging Dataframes on Multiple Keys

In [43]:
multiple_keys = pd.merge(left, right, on=['id','subject_id'])
multiple_keys

   id  Name_x subject_id Name_y
0   4   Alice       sub6  Bryce
1   5  Ayoung       sub5  Betty

### Left Join

In [44]:
pd.merge(left, right, on='subject_id', how='left')

   id_x  Name_x subject_id  id_y Name_y
0     1    Alex       sub1   NaN    NaN
1     2     Amy       sub2   1.0  Billy
2     3   Allen       sub4   2.0  Brian
3     4   Alice       sub6   4.0  Bryce
4     5  Ayoung       sub5   5.0  Betty

### Right Join

In [45]:
pd.merge(left, right, on='subject_id', how='right')

   id_x  Name_x subject_id  id_y Name_y
0   2.0     Amy       sub2     1  Billy
1   3.0   Allen       sub4     2  Brian
2   NaN     NaN       sub3     3   Bran
3   4.0   Alice       sub6     4  Bryce
4   5.0  Ayoung       sub5     5  Betty
5   NaN     NaN       sub7     6  Bella

### Outer Join

In [46]:
 pd.merge(left, right, how='outer', on='subject_id')

   id_x  Name_x subject_id  id_y Name_y
0   1.0    Alex       sub1   NaN    NaN
1   2.0     Amy       sub2   1.0  Billy
2   3.0   Allen       sub4   2.0  Brian
3   4.0   Alice       sub6   4.0  Bryce
4   5.0  Ayoung       sub5   5.0  Betty
5   NaN     NaN       sub3   3.0   Bran
6   NaN     NaN       sub7   6.0  Bella

### Inner Join

In [47]:
pd.merge(left, right, on='subject_id', how='inner')

   id_x  Name_x subject_id  id_y Name_y
0     2     Amy       sub2     1  Billy
1     3   Allen       sub4     2  Brian
2     4   Alice       sub6     4  Bryce
3     5  Ayoung       sub5     5  Betty